app/controllers/admin_controller.rb

SELECT * FROM `users` ORDER BY updated_at DESC
---
  def user
    @users = User.all(:order=>"updated_at DESC")