app/controllers/gnotes_controller.rb

  def index
    @title ="title"
    page = params[:page]
    page = 1 if params[:page].blank?
    @gnotes = Gnote.paginate :page=>page || 1, :per_page=>10,:order=>"created_at desc"
---
SELECT * FROM `gnotes` ORDER BY updated_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `gnotes`

  def show
    @gnote = Gnote.find(params[:id])
---
SELECT * FROM `gnotes` WHERE (`gnotes`.`id` = 1)

  def create
    @gnote = Gnote.new(params[:gnote])

    respond_to do |format|
      if @gnote.save
---
INSERT INTO `gnotes` (`message`, `category`, `updated_at`, `contact`, `created_at`) VALUES('<p>&nbsp;xcvxv</p>', NULL, '2010-04-03 11:33:46', 'xcv', '2010-04-03 11:33:46')

  def destroy
    @gnote = Gnote.find(params[:id])
    @gnote.destroy
---
SELECT * FROM `gnotes` WHERE (`gnotes`.`id` = 1)
DELETE FROM `gnotes` WHERE `id` = 1