app/controllers/posts_controller.rb

INSERT INTO `posts` (`category`, `updated_at`, `title`, `document`, `created_at`) VALUES('help', '2010-04-02 06:35:20', 'aa', 'aaa', '2010-04-02 06:35:20')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save