app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `message`, `updated_at`, `crypted_password`, `language`, `remember_token_expires_at`, `bg_message`, `remember_token`, `phone`, `login`, `email`, `created_at`) VALUES('e3d8e510a7b6d94442d93252f687cc8821c2a11b', NULL, '2010-03-27 05:26:29', 'c85bf91a0fce306507d3e03b5319c7bc47029c77', NULL, NULL, NULL, NULL, NULL, 'kenrome', 'kenrome@163.com', '2010-03-27 05:26:29')